app/controllers/admin/songs_controller.rb

  def index
    @songs = Song.all
---
SELECT * FROM "songs"

  def show
    @song = Song.find(params[:id])
---
SELECT * FROM "songs" WHERE ("songs"."id" = 5)

  def create
    @song = Song.new(params[:song])
    if @song.save!
---
INSERT INTO "songs" ("created_at", "title", "updated_at") VALUES('2009-10-03 20:17:29', NULL, '2009-10-03 20:17:29')