app/controllers/admin/song_versions_controller.rb

  def update
    version = SongVersion.find(params[:id])
    version.update_attributes(params[:song_version])
---
SELECT * FROM "song_versions" WHERE ("song_versions"."id" = 81)
UPDATE "song_versions" SET "updated_at" = '2009-10-04 00:08:06', "description" = 'Actually, it sucks outside right now. I''ve been procrastinating re-recording this one ever since I got this thing. I''m still not entirely happy with it, but I''m a bit more pleased with it than I was the last attempt. I appreciate the comments. [Beautiful Day (take 2)]

  def destroy
    SongVersion.find(params[:id]).destroy
---
DELETE FROM "song_versions" WHERE "id" = 109
SELECT * FROM "song_versions" WHERE ("song_versions"."id" = 109)